ХамелионЦРПТ/src/Catalogs/ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ/ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>НаименованиеПолное</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЮридическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФактическийАдрес</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КПП</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>9</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>subjectIdФармацевтика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдПроизодвителяСигареты</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИД_ЭДО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресДляОткрытия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресФакт</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ГрузополучательОтличается</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ид_ЭДО_ЦРПТ</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>subjectId_sys_Фармацевтика</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатусВЦРПТ</name>
    <type>
      <types>EnumRef.СтатусыРегистрацииКонтрагентовВЦРПТ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>email</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>GLN</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдЯщикаКонт</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Телефон</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СтранаПроисхождения</name>
    <type>
      <types>CatalogRef.СтранаПроизводства_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>ИТИН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>64</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>guid_СервисПровайдера</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СпособИзготовления</name>
    <type>
      <types>EnumRef.СпособИзготовленияСИ_ХамелеонЦРПТ</types>
    </type>
  </attributes>
  <attributes>
    <name>Коменатрий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>UIDВУчетнойСистеме</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПринятьПриемкуВЦРПТПослеЗагрузки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПриФормированииXMLДобавлятьКМПоКоробам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НеДобавлятьКМПриФормированииXML</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КодФилиала</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

ХамелионЦРПТ/src/Catalogs/ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ/Forms/ФормаВыбора/Module.bsl
&НаКлиенте
Процедура ПолучитьНаименованиеПоИНН(Команда)
	// Вставить содержимое обработчика.
	Масс1=ПолучиьМассивИНН();
	//Новый Массив;
	//Масс1.Добавить(Объект.ИНН);
	ОткрытьФорму("Справочник.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.Форма.ФормаКапчаУФ",Новый Структура("МассивКлиентов",Масс1),,,,,Новый ОписаниеОповещения("ВыбратьДвоичн",ЭтаФорма));
	
КонецПроцедуры

Функция ПолучиьМассивИНН()
	
		//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.ИНН КАК Ссылка
		|ИЗ
		|	Справочник.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ КАК ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ
		|ГДЕ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.ИНН = ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Массив=Новый Массив;
 	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		// Вставить обработку выборки ВыборкаДетальныеЗаписи
		Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) тогда
			Массив.Добавить(ВыборкаДетальныеЗаписи.Ссылка);
		КонецЕсли;
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

	Возврат   Массив
КонецФункции

Процедура	ЗаполнитьИнфуНаСервере(ВыбранноеЗначение_1)
	Для Каждого ВыбранноеЗначение_2 ИЗ ВыбранноеЗначение_1 Цикл
		
				//{{КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.Ссылка
		|ИЗ
		|	Справочник.ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ КАК ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ
		|ГДЕ
		|	ПроизводителиИмпортерыКонтрагенты_ХамелеонЦРПТ.ИНН = &ИНН";
	
	Запрос.УстановитьПараметр("ИНН", ВыбранноеЗначение_2.Значение.ИНН);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	
		Если Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.Ссылка) тогда
			Продолжить;
		КонецЕсли;
		Объект=ВыборкаДетальныеЗаписи.Ссылка.ПолучитьОбъект();
		ВыбранноеЗначение=ВыбранноеЗначение_2.Значение.Дв;
			Если ВыбранноеЗначение.Свойство("n",Объект.НаименованиеПолное) Тогда
			
			
				ВыбранноеЗначение.Свойство("n",Объект.Наименование);
				Если СтрДлина(СокрЛП(Объект.ИНН))=12 Тогда
					Объект.Наименование="ИП "+Объект.Наименование;
					
					Объект.НаименованиеПолное="ИП "+Объект.НаименованиеПолное;
				КонецЕсли;
			КонецЕсли;
			//Заполним адреса
			
			ВыбранноеЗначение.Свойство("a",Объект.ЮридическийАдрес);
			Объект.Записать();
		КонецЦикла;
		Конеццикла;
			//ВыбранноеЗначение.Свойство("o",Объект.ОГРН);
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьДвоичн(ВыбранноеЗначение_1, ИсточникВыбора) Экспорт
 	// Вставить содержимое обработчика.
	Если ЗначениеЗаполнено(ВыбранноеЗначение_1) Тогда
		Если ВыбранноеЗначение_1.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
			
			ЗаполнитьИнфуНаСервере(ВыбранноеЗначение_1);
		//Объект.ИНН						= ВыбранноеЗначение.i;
	
	КонецЕсли;
	Элементы.Список.Обновить();
КонецПроцедуры
